In [21]:
import numpy as np
from sklearn import linear_model
from sklearn.linear_model import LinearRegression
import pandas as pd
import math

In [3]:


df=pd.read_csv('area_price.csv')
df

   area   price
0  2600  550000
1  3000  565000
2  3200  610000
3  3600  680000
4  4000  725000

import numpy as np
def gradient_descent(x,y):
    m_cur = b_cur =0
    iteration=1000000
    n=len(x)
    learning_rate=0.0002
    cost_prev = 0
    
    for i in range(iteration):
        y_pred = m_cur * x + b_cur
        cost = (1/n) * sum([val**2 for val in (y-y_pred)])
        md =-(2/n) * sum(x * (y-y_pred))
        bd = -(2/n) * sum(y-y_pred)
        m_cur = m_cur - learning_rate +md
        b_cur = b_cur - learning_rate +bd
        if math.isclose(cost,cost_prev,rel_tol=1e-20):
            break
        cost_prev=cost
        print(f"m ={m_cur}, b ={b_cur} , cost = {cost}")
        
x=np.array(df.area)
y=np.array(df.price)

gradient_descent(x,y)

In [6]:

reg=linear_model.LinearRegression(n_jobs=1)
reg.fit(df[['area']],df.price)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [7]:
reg.coef_

array([135.78767123])

In [8]:
reg.intercept_

180616.43835616432

In [28]:
df1=pd.read_csv('carprices.csv')
df1.head()

  Car_model  Mileage  Sell_price  years_old
0    BMW X5    69000       18000          6
1    BMW X5    35000       34000          3
2    BMW X5    57000       26100          5
3    BMW X5    22500       40000          2
4    BMW X5    46000       31500          4

In [29]:
dummies=pd.get_dummies(df1.Car_model)
dummies.head()

   Audi A5  BMW X5  Mercedez
0        0       1         0
1        0       1         0
2        0       1         0
3        0       1         0
4        0       1         0

In [30]:
merged=pd.concat([df1,dummies],axis=1)
merged.head()

  Car_model  Mileage  Sell_price  years_old  Audi A5  BMW X5  Mercedez
0    BMW X5    69000       18000          6        0       1         0
1    BMW X5    35000       34000          3        0       1         0
2    BMW X5    57000       26100          5        0       1         0
3    BMW X5    22500       40000          2        0       1         0
4    BMW X5    46000       31500          4        0       1         0

In [13]:
final=merged.drop(['Car_model'],axis=1)
final.head()

   Mileage  Sell_price  years_old  Audi A5  BMW X5  Mercedez
0    69000       18000          6        0       1         0
1    35000       34000          3        0       1         0
2    57000       26100          5        0       1         0
3    22500       40000          2        0       1         0
4    46000       31500          4        0       1         0

In [16]:
X=final.drop(['Sell_price'],axis=1)
X.head()
#Audi A5=1,0,0
#BMW X5=0,1,0
#Mercedez=0,0,1

   Mileage  years_old  Audi A5  BMW X5  Mercedez
0    69000          6        0       1         0
1    35000          3        0       1         0
2    57000          5        0       1         0
3    22500          2        0       1         0
4    46000          4        0       1         0

In [18]:
Y=final.Sell_price
Y.head()

0    18000
1    34000
2    26100
3    40000
4    31500
Name: Sell_price, dtype: int64

In [22]:
reg=LinearRegression()
reg.fit(X,Y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [23]:
reg.predict([[45000,4,0,0,1]])

array([36991.31721061])

In [24]:
reg.score(X,Y)

0.9417050937281082

In [26]:
from sklearn.preprocessing import LabelEncoder
le= LabelEncoder()

In [34]:
dfle=df1
dfle.Car_model=le.fit_transform(dfle.Car_model)
dfle

    Car_model  Mileage  Sell_price  years_old
0           1    69000       18000          6
1           1    35000       34000          3
2           1    57000       26100          5
3           1    22500       40000          2
4           1    46000       31500          4
5           0    59000       29400          5
6           0    52000       32000          5
7           0    72000       19300          6
8           0    91000       12000          8
9           2    67000       22000          6
10          2    83000       20000          7
11          2    79000       21000          7
12          2    59000       33000          5

In [44]:
#from sklearn.preprocessing import OneHotEncoder
#ohe=OneHotEncoder(categorical_features=[0])
#ohe.fit_transform(X).toarray()
#we dont need this bcz of it is too more confuse